src/cfe/КСП/InformationRegisters/КСП_НастройкиРаспределенияДоступногоОстатка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_НастройкиРаспределенияДоступногоОстатка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_НастройкиРаспределенияДоступногоОстатка/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(КСП_НастройкиРаспределенияДоступногоОстатка.ПроцентРаспределения) КАК ПроцентРаспределения
	               |ИЗ
	               |	РегистрСведений.КСП_НастройкиРаспределенияДоступногоОстатка КАК КСП_НастройкиРаспределенияДоступногоОстатка
	               |ГДЕ
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение.Родитель = &Родитель
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение <> &Подразделение
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Сезон = &Сезон
	               |	И ГОД(КСП_НастройкиРаспределенияДоступногоОстатка.Период) = ГОД(&Период)";    
	
	Запрос.Параметры.Вставить("Подразделение", ЭтотОбъект.Запись.Подразделение);
	Запрос.Параметры.Вставить("Сезон", ЭтотОбъект.Запись.Сезон);
	Запрос.Параметры.Вставить("Период", ЭтотОбъект.Запись.Период);
	Запрос.Параметры.Вставить("Родитель", ЭтотОбъект.Запись.Подразделение.Родитель);

	ТаблицаПроцентов = Запрос.Выполнить().Выгрузить();
	
	СуммаПроцент = ЭтотОбъект.Запись.ПроцентРаспределения;
	
	Для каждого СтрокаНастроек из  ТаблицаПроцентов Цикл 
		
		СуммаПроцент = СуммаПроцент + СтрокаНастроек.ПроцентРаспределения;
	
	КонецЦикла;
	
	Если СуммаПроцент > 100 Тогда
		Сообщить("Не возможно записать настройку распределения. Общий процент по группе превышает 100%");
		Отказ = Истина;
		//Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры
